//UNEMPCBL  JOB (ACCT),'COB SUB',CLASS=A,MSGCLASS=X,NOTIFY=&SYSUID
//*
//* COBOL CICS COMPILE JOB (EIB RUNTIME DISPLAY)
//*
//CICSPROG   EXEC DFHZITCL                       IBM CICS COMPILE PROC
//COBOL.SYSIN  DD DISP=SHR,DSN=&SYSUID..CBL(COBSUB1)  MY COBOL PROGRAM
//COBOL.SYSLIB DD DISP=SHR,DSN=DFH620.CICS.SDFHCOB      CICS COPYBOOKS
//             DD DISP=SHR,DSN=&SYSUID..MAPS.COPYLIB      MY COPYBOOKS
//LKED.SYSLMOD DD DISP=SHR,DSN=&SYSUID..CICS.PROD.DFHLOAD   MY LOADLIB
//LKED.SYSIN   DD *,SYMBOLS=EXECSYS
  NAME COBSUB1(R)
/*
